const form = document.querySelector('#answer');
const questionInput = document.querySelector('#autoComplete');
const answerText = document.querySelector('#answer-text');

form.addEventListener('submit', findAnswer);

function getKeyByValue(object, value) {
  return value ? Object.keys(object).find(key => object[key] === value) : 'No';
}

function findAnswer(e) {
  e.preventDefault();
  answerText.innerHTML = '';

  let question = questionInput.value;

  answerText.innerHTML = `${getKeyByValue(answersList, answersList[question])} - <b>${answersList[question]}</b>` || 'Нет ответа';
};

const answersList = {
  "1.  Для чого призначені автомобільні підрозділи батальйонів (рот, взводів) матеріального забезпечення?":
    "- приймання і утримання бригадних, полкових, батальйонних запасів матеріальних засобів - підвезення (відправлення, відпускання) їх частинам і підрозділам - перевезення особового складу, евакуації несправних та непотрібних для бою озброєння, техніки і майна- автомобільні відділення взводів матеріального забезпечення (взводів забезпечення) батальйонів і дивізіонів - також для заправлення техніки пальним.",
    "2.  Якими способами здійснюється робота автомобільних частин і підрозділів в операції (бою)?": '- Метод послідовної роботи - Метод паралельної роботи',
    "3.  Що повинна забезпечувати вантажопідйомність автомобільних рот (взводів, відділень)?": '- безперервне управління підрозділами, своєчасне формулювання рішення, постановку завдань підрозділам і оперативне реагування на зміни в обстановці.',
    "4.  Які підрозділи входять до складу роти забезпечення механізованого батальйону омбр?": 'три механізованих роти, гранатометний взвод, зенітно – ракетний взвод, мінометна батарея',
    "5.  Які підрозділи входять до складу взводу матеріального забезпечення роти забезпечення механізованого батальйону омбр?": 'відділення технічного обслуговування, автомобільного відділення та господарчого відділення.',
    "6.  Які підрозділи входять до складу взводу матеріального забезпечення, роти забезпечення, танкового батальйону омбр?": '',
    "7.  Які підрозділи входять до складу взводу забезпечення, самохідного артилерійського дивізіону  омбр?": '',
    " 8.  Які автомобільні підрозділи входять до складу батальйону матеріального забезпечення омбр?": 'До складу взводу матеріального забезпечення входять: - командир взводу; - автомобільне відділення; -автомобільне відділення підвезення боєприпасів; - господарське відділення.',
    "9.  Скільки вантажних автомобілів у складі автомобільного відділення підвозу БП, взводу матеріального забезпечення, роти забезпечення, танкового батальйону омбр?": 'Всього у взводі матеріального забезпечення: особового складу —  автомобілів Урал-4320 — 6; автомобіль ЗІЛ-131 — 1; автомобільний пально-мастильний заправник АТМЗ-5-4320 — 1; автомобільні пальні заправники ТЗ-8-255Б — 2; кухня автомобільна ПАК-200 — 1; причеп-цистерна для води ЦВ-1,2 — 1; Всього у автомобільному відділенні: - особового складу — вантажних автомобілів: - Урал-4320 (під артилерійські боєприпаси) — 4; - Урал-4320 (під військово-технічне майно) — 1; - Урал-4320 (під майно рот) — 1; - автомобільний пально-мастильний заправник АТМЗ-5-4320 — 1; - автомобільні пальні заправники ТЗ-8-255Б — 2. Всього у танковому батальйоні: автомобілів — 15;',
    "10.  Скільки вантажних автомобілів у складі автомобільного відділення підвозу БП, взводу матеріального забезпечення, роти забезпечення, механізованого батальйону омбр?": '',
    "11.  Скільки вантажних автомобілів у складі автомобільного відділення підвозу ПММ, взводу матеріального забезпечення, роти забезпечення, механізованого батальйону омбр?": '',
    " 12.  Скільки спеціальних автомобілів АЦ-5,5-4320 у складі автомобільного відділення підвозу ПММ, взводу матеріального забезпечення, роти забезпечення, механізованого батальйону омбр?": '1, 1, 4, 12',
    "13.  Скільки спеціальних автомобілів АЦ-5,5-4320 у складі автомобільного відділення підвозу ПММ, взводу матеріального забезпечення, роти забезпечення, танкового батальйону омбр?": '1, 1, 4, 12',
    "14.  Скільки потрібно вантажних автомобілів Урал-4320 для перевезення за один рейс 40т. військово-технічного майна при КВВ = 0,8?": 'N=40/(5*0.8)=10',
    "15.  Скільки потрібно вантажних автомобілів Урал-4320 для перевезення за один рейс 40т. військово-технічного майна при КВВ = 1,0": 'N=40/5=8',
    "16.  Скільки потрібно вантажних автомобілів Урал-4320 для перевезення за один рейс 30т. військово-технічного майна при КВВ = 0,6": 'N=30/(5*0.6)=10',
    "17.  Скільки потрібно спеціальних автомобілів АТМЗ-5-4320 для перевезення за один рейс 20т. пально-мастильних матеріалів при КВВ = 0,8": 'N=20/(5*0.8)=5',
    "18.  Скільки потрібно спеціальних автомобілів АТМЗ-5-4320 для перевезення за один рейс 40т. пально-мастильних матеріалів при КВВ = 0,8?": 'N=40/(5*0.8)=10',
    "19.  Чому дорівнює КТГ автомобільної роти якщо кількість несправної техніки складає 10 автомобілів при облікової кількості 100 автомобілів?": 'КТГ = 90/100 = 0,9',
    "20.  Чому дорівнює КТГ автомобільної роти якщо кількість несправної техніки складає 15 автомобілів при облікової кількості 100 автомобілів?": '85 / 100 = 0.85',
    "21.  Чому дорівнює КТГ автомобільної роти якщо кількість несправної техніки складає 5 автомобілів при облікової кількості 100 автомобілів?": '95 / 100 = 0.95',
    "22.  Чому дорівнює КТГ автомобільної роти якщо кількість несправної техніки складає 4 автомобілів при обліковій кількості 100 автомобілів?": '96 / 100 = 0.96',
    "23.  Чому дорівнює КТГ автомобільної роти якщо кількість несправної техніки складає 8 автомобілів при облікової кількості 100 автомобілів?": '92/100 = 0,92',
    "24.  На якому взаємному віддаленні розташовуються взводи автомобільної роти при її розміщенні на місцевості? ": '1.5-2 км',
    "25.  На якому взаємному віддаленні розташовуються автомобільні відділення взводів при розміщенні на місцевості у складі автомобільної роти ?": 'До 200 метрів',
    "26.  На якій відстані повинні знаходитись один від одного, два поряд розміщених автомобіля при розташуванні підрозділу на місцевості?": '25 -50 м',
    "27.  Яку площу може займати автомобільне відділення із складу автомобільної роти, батальйону матеріального забезпечення омбр при розташуванні на місцевості?": ' О.3 км²',
    "28.  Яку площу може займати автомобільний взвод зі складу автомобільної роти батальйону матеріального забезпечення омбр при розташуванні на місцевості?": '1 км²',
    "29.  Яка середня дистанції в русі між автомобілями у ході маршу автомобільного підрозділу?": '',
    "30.  Якою має бути дистанція між автомобілями при зупинці колони ?": '',
    "31.  Якою має бути дистанція в русі між колонами автомобільних взводів у ході маршу автомобільного підрозділу?": '',
    "32.  Якою має бути дистанція в русі між колонами автомобільних рот у ході маршу автомобільного підрозділу?": '',
    "33.  Яка середня технічна швидкість руху автомобільних колон у день?": '',
    "34.  Комплекс яких заходів слід розуміти під організацією військових автомобільних перевезень?": '',
    "35.  На які види підрозділяються військові автомобільні перевезення, у залежності від характеру і призначення?": 'У залежності від характеру і призначення військові автомобільні перевезення підрозділяються на наступні види: —  оперативні — перевезення військових частин (підрозділів), установ і бойової техніки; — людські — перевезення призовників і що звільняються, а також інших військових команд; — постачальницькі - перевезення матеріальних засобів і інших військових вантажів; — евакуаційні - перевезення з фронту в тил поранених, хворих, не потрібних військам і потребуючих ремонту техніки, озброєння і майна.',
    "36.  У чому полягає сутність централізованнх перевезень?": 'Сутність централізованих перевезень полягає в тім, що автомобільний транспорт використовується за єдиним планом в інтересах усіх військових частин гарнізону.',
    "37.  З яких пунктів складається  район навантаження (розвантаження)?": 'Райони навантаження (вивантаження) містять у собі: - пункти очікування автомобільного транспорту перед навантаженням (вивантаженням) вантажів,v пункти навантаження (вивантаження), - пункти збору автомобільного транспорту після навантаження (вивантаження), - основні і запасні шляхи для в\'їзду в пункти навантаження (вивантаження) і виїзду на автомобільну дорогу.',
    "38.  Що включає усвідомлення завдання командиром автомобільного підрозділу під час підготовки до перевезень?": 'Під час усвідомлення отриманого завдання командир взводу повинен зрозуміти який опорний пункт зайняти, завдання щодо відбиття наступу і знищення противника, що вклинився в оборону; смугу вогню, додаткові сектори обстрілу і ділянки зосередженого вогню взводу; якими силами і засобами забезпечуються фланги, стики, проміжки і хто відповідальний за них, які сили і засоби виділити для здійснення охорони); завдання, які виконуються силами і засобами старшого командира в інтересах дій взводу; завдання сусідів і порядок взаємодії з ними; час зайняття оборони, готовності системи вогню, терміни та обсяг інженерного обладнання опорного пункту.',
    "39.  Які заходи проводяться під час підготовки автомобільного підрозділу до перевезень у першу чергу ?": 'Підготовка автомобілів, автопоїздів і причепів до перевезення матеріальних засобів полягає в проведенні контрольного огляду, в приведенні автомобілів в справний стан, укомплектуванні покладеними запасними частинами (інструментом, приладдям), обладнанні кузовів під перевезення конкретних видів матеріальних засобів, а також у підготовці для роботи в відповідних умовах місцевості і пори року.',
    "40.  Розкрийте зміст попереднього розпорядження командира автомобільного підрозділу під час підготовки до перевезень?": 'КОМАНДИР АВТОМОБІЛЬНОГО ПІДРОЗДІЛУ ПОВИНЕН: 1. Усвідомити отримане завдання. 2.Визначити зміст заходів, які необхідно провести в першу чергу. 3. Провести розрахунок часу. 4. Підготувати та довести попереднє розпорядження. Готувати особовий склад. Готувати транспортні засоби до перевезення. 5. Оцінити обстановку. 6. Прийняти рішення. 7. Доповідь рішення старшому начальнику. Отримати в штабі документи на перевезення. 8. Сформувати колону. 9. Довести наказ на перевезення. 10 Доповісти про готовність до виконання завдання.',
    "41.  Що оцінює командир автомобільного підрозділу під час оцінки обстановки при підготовці до перевезень?": 'При організації автомобільних перевезень необхідно враховувати конкретні умови, при яких будуть вони здійснюватися: місцевість, клімат, час року, тривалість, умови навантаження і вивантаження, довжину і стан маршрутів руху, дорожнє забезпечення та інші фактори, що впливають на своєчасне і якісне виконання перевезень.',
    "42.  Що вказує командир автомобільного підрозділу в рішенні на перевезення?": '',
    "43.  Що включає підготовка транспортних засобів до перевезення?": '',
    "44.  Що вказує командир автомобільного підрозділу у наказі на перевезення?": ' відомості про противника положення своїх військ; завдання колони;райони навантаження й вивантаження;час і порядок виходу на маршрут;маршрут та порядок руху.місця автомобілів у колоні, швидкість руху й дистанції між підрозділами та автомобілями в дорозі;час і місця привалів і відпочинку;порядок дозаправки автомобілів і харчування особового складу;організацію медичного забезпечення;завдання ЗПК;заходи щодо забезпечення безпеки при навантаженні, вивантаженні і перевезенні вантажів, а також порядок подолання мостів, підйомів, бродів;завдання щодо захисту, охорони та оборони колони; організація управління колоною.',
    "45.  Від чого залежить час простою автотранспорту під вантажною операцією?": 'Від організації навантажувально-розвантажувальних робіт.',
    "46.  Яким показником характеризується коефіцієнт використання вантажопідйомності (КВВ)?": 'Показником, що характеризує готовність рухомого складу виконувати перевізний процес, є коефіцієнт технічної готовності рухомого складу ат. Він визначається відношенням числа технічно справних автомобілів до їх обліковому числу даного АТП. Якщо в АТП облікове число автомобілів на сьогодні дорівнює 500, а технічно справних на сьогодні автомобілів 420 то коефіцієнт технічної готовності парку автомобілів на дане число ат = 420/500 = 084.',
    "47.  На які класи поділяються вантажі  у залежності від об'ємної ваги?": 'У залежності від об\'ємної ваги усі вантажі підрозділяються  на чотири класи. До першого класу відносяться вантажі, що забезпечують коефіцієнт використання вантажопідйомності автомобіля 1,0; до другого класу — від 0,71 до 0,99; до третього класу — від 0,51 до 0,7; до четвертого класу — до 0,5.',
    "48.  Що таке контейнер?": 'Контейнером називається запобіжно-транспортне упакування багаторазового вживання, пристосоване для механізованого навантаження, розвантаження і перевантаження вантажів, як правило, що має обсяг понад 1 м3 і вантажопідйомність не менше 1 т.',
    "49.  Як підрозділяються піддони у залежності від конструктивного виконання?": 'плоскі, стоєчні і ящикові',
    "50.  Яким основним вимогам має відповідати район навантаження (вивантаження)?": '',
    "51.  Що таке фронт навантаження (вивантаження) пункту (площадки) навантаження?": 'Якісний вибір забів навантаження скорочує час простою автомобілів і зменшують потребу особового складу для перевантажувальних робіт. Вибір засобів залежить насамперед від типу грузу ,чи будуть це боєприпаси , чи господарчий груз , або ППМ, тобто від характеру вантажу. тари і пакування. . Від обсягу робіт, від типу автомобілів , причепів та напів причепів ',
    "52.  Від чого залежить вибір вантажно-розвантажувальних засобів механізації?": 'Якісний вибір забів навантаження скорочує час простою автомобілів і зменшують потребу особового складу для перевантажувальних робіт. Вибір засобів залежить насамперед від типу грузу ,чи будуть це боєприпаси , чи господарчий груз , або ППМ, тобто від характеру вантажу. тари і пакування. . Від обсягу робіт, від типу автомобілів , причепів та напів причепів',
    "53.  Які навантажно-розвантажувальні засоби застосовуються для механізації навантаження (розвантаження) вантажів на автомобільному транспорті?": '',
    "54.  Для чого призначається вихідний пункт на маршруті руху для колони?": '',
    "55.  Які основні роботи виконуються при підготовці автомобілів до перевезення?": 'уcвiдомлення отриманого завдання; визначення невідкладних заходів (заходiв, якi необхiдно провеcти в першу чергу); проведення розрахунку часу; підготовка та доведення попереднього розпорядження до підлеглих; оцiнка обстановки; прийняття рiшення та його доповідь старшому начальнику; підготовка особового складу та транспортних засобів до виконання перевезень; отримання в штабі частини (підрозділу) документів на перевезення; формування колони та доповідь старшому начальнику про готовність до виконання перевезень; доведення наказу на виконання перевезень.',
    "56.  Які першочергові заходи виконуються на зупинках і привалах?": '',
    "57.  На які основні види підрозділяються евакуаційні перевезення?": '',
    "58.  Яким чином починається укладання вантажів у кузовах автомобілів (причепів)?": 'Укладання вантажів у кузовах автомобілів (причепів) повинна починатися від кабіни рядами на усю висоту навантаження.',
    "59.  Яким чином відповідно до ваги розподілятися вантаж на підлозі кузова?": 'По вазі вантаж повинний розподілятися симетрично щодо подовжньої осі автомобіля і рівномірно по всій площі підлоги кузова.',
    "60.  Дати визначення  “Плече підвозу”?": 'Відстань (у кілометрах) від пункту навантаження до пункту вивантаження, на яке повинний бути перевезений вантаж.',
    "61.  Дати визначення  “Тривалість роботи водія?": 'Залежно від умов роботи водія облік робочого часу може бути поденний, щотижневий або підсумований. Нормальна тривалість робочого часу водіїв не повинна перевищувати 40 годин на тиждень. Змінний період керування, включаючи надурочні роботи, не повинен перевищувати 9 годин, а при перевезенні великовагових, та/або великогабаритних, та/або небезпечних вантажів — 8 годин. Тривалість щотижневого відпочинку водія має бути не менше 45 послідовних годин.',
};
